TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp1.h
/* ANACOMP1_MIS Bits */
/* ANACOMP1_MIS[COMPIFG] Bits */
#define ANACOMP1_MIS_COMPIFG_OFS                 (1)                             /* !< COMPIFG Offset */
#define ANACOMP1_MIS_COMPIFG_MASK                ((uint32_t)0x00000002U)         /* !< Masked interrupt status for COMPIFG */
#define ANACOMP1_MIS_COMPIFG_CLR                 ((uint32_t)0x00000000U)         /* !< COMPIFG does not request an
                                                                                    interrupt service routine */
#define ANACOMP1_MIS_COMPIFG_SET                 ((uint32_t)0x00000002U)         /* !< COMPIFG requests an interrupt
                                                                                    service routine */
/* ANACOMP1_MIS[COMPINVIFG] Bits */
#define ANACOMP1_MIS_COMPINVIFG_OFS              (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP1_MIS_COMPINVIFG_MASK             ((uint32_t)0x00000004U)         /* !< Masked interrupt status for
                                                                                    COMPINVIFG */
#define ANACOMP1_MIS_COMPINVIFG_CLR              ((uint32_t)0x00000000U)         /* !< COMPINVIFG does not request an
                                                                                    interrupt service routine */
#define ANACOMP1_MIS_COMPINVIFG_SET              ((uint32_t)0x00000004U)         /* !< COMPINVIFG requests an interrupt
                                                                                    service routine */
/* ANACOMP1_MIS[OUTRDYIFG] Bits */
#define ANACOMP1_MIS_OUTRDYIFG_OFS               (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP1_MIS_OUTRDYIFG_MASK              ((uint32_t)0x00000008U)         /* !< Masked interrupt status for
                                                                                    OUTRDYIFG */
#define ANACOMP1_MIS_OUTRDYIFG_CLR               ((uint32_t)0x00000000U)         /* !< OUTRDYIFG does not request an
                                                                                    interrupt service routine */
#define ANACOMP1_MIS_OUTRDYIFG_SET               ((uint32_t)0x00000008U)         /* !< OUTRDYIFG requests an interrupt
                                                                                    service routine */

/* ANACOMP1_ISET Bits */
/* ANACOMP1_ISET[COMPIFG] Bits */
#define ANACOMP1_ISET_COMPIFG_OFS                (1)                             /* !< COMPIFG Offset */
#define ANACOMP1_ISET_COMPIFG_MASK               ((uint32_t)0x00000002U)         /* !< Sets COMPIFG in RIS register */
#define ANACOMP1_ISET_COMPIFG_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP1_ISET_COMPIFG_SET                ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to COMPIFG is
                                                                                    set */
/* ANACOMP1_ISET[COMPINVIFG] Bits */
#define ANACOMP1_ISET_COMPINVIFG_OFS             (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP1_ISET_COMPINVIFG_MASK            ((uint32_t)0x00000004U)         /* !< Sets COMPINVIFG in RIS register */
#define ANACOMP1_ISET_COMPINVIFG_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP1_ISET_COMPINVIFG_SET             ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to COMPINVIFG
                                                                                    is set */
/* ANACOMP1_ISET[OUTRDYIFG] Bits */
#define ANACOMP1_ISET_OUTRDYIFG_OFS              (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP1_ISET_OUTRDYIFG_MASK             ((uint32_t)0x00000008U)         /* !< Sets OUTRDYIFG in RIS register */
#define ANACOMP1_ISET_OUTRDYIFG_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP1_ISET_OUTRDYIFG_SET              ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to OUTRDYIFG
                                                                                    is set */

/* ANACOMP1_ICLR Bits */
/* ANACOMP1_ICLR[COMPIFG] Bits */
#define ANACOMP1_ICLR_COMPIFG_OFS                (1)                             /* !< COMPIFG Offset */
#define ANACOMP1_ICLR_COMPIFG_MASK               ((uint32_t)0x00000002U)         /* !< Clears COMPIFG in RIS register */
#define ANACOMP1_ICLR_COMPIFG_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP1_ICLR_COMPIFG_CLR                ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to COMPIFG is
                                                                                    cleared */
/* ANACOMP1_ICLR[COMPINVIFG] Bits */
#define ANACOMP1_ICLR_COMPINVIFG_OFS             (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP1_ICLR_COMPINVIFG_MASK            ((uint32_t)0x00000004U)         /* !< Clears COMPINVIFG in RIS register */
#define ANACOMP1_ICLR_COMPINVIFG_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP1_ICLR_COMPINVIFG_CLR             ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to COMPINVIFG
                                                                                    is cleared */
/* ANACOMP1_ICLR[OUTRDYIFG] Bits */
#define ANACOMP1_ICLR_OUTRDYIFG_OFS              (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP1_ICLR_OUTRDYIFG_MASK             ((uint32_t)0x00000008U)         /* !< Clears OUTRDYIFG in RIS register */
#define ANACOMP1_ICLR_OUTRDYIFG_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP1_ICLR_OUTRDYIFG_CLR              ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to OUTRDYIFG
                                                                                    is cleared */

/* ANACOMP1_PWREN Bits */
/* ANACOMP1_PWREN[ENABLE] Bits */
#define ANACOMP1_PWREN_ENABLE_OFS                (0)                             /* !< ENABLE Offset */
#define ANACOMP1_PWREN_ENABLE_MASK               ((uint32_t)0x00000001U)         /* !< Enable the power */
#define ANACOMP1_PWREN_ENABLE_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable Power */
#define ANACOMP1_PWREN_ENABLE_ENABLE             ((uint32_t)0x00000001U)         /* !< Enable Power */
/* ANACOMP1_PWREN[KEY] Bits */
#define ANACOMP1_PWREN_KEY_OFS                   (24)                            /* !< KEY Offset */
#define ANACOMP1_PWREN_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define ANACOMP1_PWREN_KEY_UNLOCK_W              ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* ANACOMP1_RSTCTL Bits */
/* ANACOMP1_RSTCTL[RESETSTKYCLR] Bits */
#define ANACOMP1_RSTCTL_RESETSTKYCLR_OFS         (1)                             /* !< RESETSTKYCLR Offset */
#define ANACOMP1_RSTCTL_RESETSTKYCLR_MASK        ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define ANACOMP1_RSTCTL_RESETSTKYCLR_NOP         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define ANACOMP1_RSTCTL_RESETSTKYCLR_CLR         ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* ANACOMP1_RSTCTL[RESETASSERT] Bits */
#define ANACOMP1_RSTCTL_RESETASSERT_OFS          (0)                             /* !< RESETASSERT Offset */
#define ANACOMP1_RSTCTL_RESETASSERT_MASK         ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define ANACOMP1_RSTCTL_RESETASSERT_NOP          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define ANACOMP1_RSTCTL_RESETASSERT_ASSERT       ((uint32_t)0x00000001U)         /* !< Assert reset */
/* ANACOMP1_RSTCTL[KEY] Bits */
#define ANACOMP1_RSTCTL_KEY_OFS                  (24)                            /* !< KEY Offset */
#define ANACOMP1_RSTCTL_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define ANACOMP1_RSTCTL_KEY_UNLOCK_W             ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* ANACOMP1_CLKCFG Bits */
/* ANACOMP1_CLKCFG[KEY] Bits */
#define ANACOMP1_CLKCFG_KEY_OFS                  (24)                            /* !< KEY Offset */
#define ANACOMP1_CLKCFG_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define ANACOMP1_CLKCFG_KEY_UNLOCK               ((uint32_t)0xA9000000U)         /* !< Key value to be used in writing to
                                                                                    this register for the write to take
                                                                                    effect. */
/* ANACOMP1_CLKCFG[BLOCKASYNC] Bits */
#define ANACOMP1_CLKCFG_BLOCKASYNC_OFS           (8)                             /* !< BLOCKASYNC Offset */
#define ANACOMP1_CLKCFG_BLOCKASYNC_MASK          ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define ANACOMP1_CLKCFG_BLOCKASYNC_DISABLE       ((uint32_t)0x00000000U)         /* !< disable COMP to request SYSOSC */
#define ANACOMP1_CLKCFG_BLOCKASYNC_ENABLE        ((uint32_t)0x00000100U)         /* !< enable COMP to request SYSOSC */

/* ANACOMP1_GPRCM_STAT Bits */
/* ANACOMP1_GPRCM_STAT[RESETSTKY] Bits */
#define ANACOMP1_GPRCM_STAT_RESETSTKY_OFS        (16)                            /* !< RESETSTKY Offset */
#define ANACOMP1_GPRCM_STAT_RESETSTKY_MASK       ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define ANACOMP1_GPRCM_STAT_RESETSTKY_NORES      ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define ANACOMP1_GPRCM_STAT_RESETSTKY_RESET      ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* ANACOMP1_FUPDATE_AIN Bits */
/* ANACOMP1_FUPDATE_AIN[IOADDR] Bits */
#define ANACOMP1_FUPDATE_AIN_IOADDR_OFS          (2)                             /* !< IOADDR Offset */
#define ANACOMP1_FUPDATE_AIN_IOADDR_MASK         ((uint32_t)0x0FFFFFFCU)         /* !< IO Address This is the address that
                                                                                    corresponds to the SOC address[27:2]
                                                                                    of the module IP instance specific IO
                                                                                    signal in the Full Write subregion of
                                                                                    the pinmux subregion. */
/* ANACOMP1_FUPDATE_AIN[LOCK] Bits */
#define ANACOMP1_FUPDATE_AIN_LOCK_OFS            (1)                             /* !< LOCK Offset */
#define ANACOMP1_FUPDATE_AIN_LOCK_MASK           ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define ANACOMP1_FUPDATE_AIN_LOCK_NOEFFECT       ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define ANACOMP1_FUPDATE_AIN_LOCK_LOCK           ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* ANACOMP1_FUPDATE_AIN[GSEL] Bits */
#define ANACOMP1_FUPDATE_AIN_GSEL_OFS            (0)                             /* !< GSEL Offset */
#define ANACOMP1_FUPDATE_AIN_GSEL_MASK           ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define ANACOMP1_FUPDATE_AIN_GSEL_PCHAN          ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define ANACOMP1_FUPDATE_AIN_GSEL_GCHAN          ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* ANACOMP1_STAT_AIN Bits */
/* ANACOMP1_STAT_AIN[PAD] Bits */
#define ANACOMP1_STAT_AIN_PAD_OFS                (0)                             /* !< PAD Offset */
#define ANACOMP1_STAT_AIN_PAD_MASK               ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* ANACOMP1_FUPDATE_OUT Bits */
/* ANACOMP1_FUPDATE_OUT[IOADDR] Bits */
#define ANACOMP1_FUPDATE_OUT_IOADDR_OFS          (2)                             /* !< IOADDR Offset */
#define ANACOMP1_FUPDATE_OUT_IOADDR_MASK         ((uint32_t)0x0FFFFFFCU)         /* !< IO Address This is the address that
                                                                                    corresponds to the SOC address[27:2]
                                                                                    of the module IP instance specific IO
                                                                                    signal in the Full Write subregion of
                                                                                    the pinmux subregion. */
/* ANACOMP1_FUPDATE_OUT[LOCK] Bits */
#define ANACOMP1_FUPDATE_OUT_LOCK_OFS            (1)                             /* !< LOCK Offset */
#define ANACOMP1_FUPDATE_OUT_LOCK_MASK           ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define ANACOMP1_FUPDATE_OUT_LOCK_NOEFFECT       ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define ANACOMP1_FUPDATE_OUT_LOCK_LOCK           ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* ANACOMP1_FUPDATE_OUT[GSEL] Bits */
#define ANACOMP1_FUPDATE_OUT_GSEL_OFS            (0)                             /* !< GSEL Offset */
#define ANACOMP1_FUPDATE_OUT_GSEL_MASK           ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define ANACOMP1_FUPDATE_OUT_GSEL_PCHAN          ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define ANACOMP1_FUPDATE_OUT_GSEL_GCHAN          ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

