TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp1.h
/* ANACOMP1_STAT_OUT Bits */
/* ANACOMP1_STAT_OUT[PAD] Bits */
#define ANACOMP1_STAT_OUT_PAD_OFS                (0)                             /* !< PAD Offset */
#define ANACOMP1_STAT_OUT_PAD_MASK               ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* ANACOMP1_PINCM_AIN Bits */
/* ANACOMP1_PINCM_AIN[PSTATE] Bits */
#define ANACOMP1_PINCM_AIN_PSTATE_OFS            (6)                             /* !< PSTATE Offset */
#define ANACOMP1_PINCM_AIN_PSTATE_MASK           ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define ANACOMP1_PINCM_AIN_PSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define ANACOMP1_PINCM_AIN_PSTATE_HANDOVER       ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define ANACOMP1_PINCM_AIN_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP1_PINCM_AIN_PSTATE_CONC_LOCKED    ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* ANACOMP1_PINCM_AIN[GSTATE] Bits */
#define ANACOMP1_PINCM_AIN_GSTATE_OFS            (14)                            /* !< GSTATE Offset */
#define ANACOMP1_PINCM_AIN_GSTATE_MASK           ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define ANACOMP1_PINCM_AIN_GSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define ANACOMP1_PINCM_AIN_GSTATE_HANDOVER       ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define ANACOMP1_PINCM_AIN_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP1_PINCM_AIN_GSTATE_CONC_LOCKED    ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */

/* ANACOMP1_PINCM_OUT Bits */
/* ANACOMP1_PINCM_OUT[PSTATE] Bits */
#define ANACOMP1_PINCM_OUT_PSTATE_OFS            (6)                             /* !< PSTATE Offset */
#define ANACOMP1_PINCM_OUT_PSTATE_MASK           ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define ANACOMP1_PINCM_OUT_PSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define ANACOMP1_PINCM_OUT_PSTATE_HANDOVER       ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define ANACOMP1_PINCM_OUT_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP1_PINCM_OUT_PSTATE_CONC_LOCKED    ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* ANACOMP1_PINCM_OUT[GSTATE] Bits */
#define ANACOMP1_PINCM_OUT_GSTATE_OFS            (14)                            /* !< GSTATE Offset */
#define ANACOMP1_PINCM_OUT_GSTATE_MASK           ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define ANACOMP1_PINCM_OUT_GSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define ANACOMP1_PINCM_OUT_GSTATE_HANDOVER       ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define ANACOMP1_PINCM_OUT_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP1_PINCM_OUT_GSTATE_CONC_LOCKED    ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* ANACOMP1_PINCM_OUT[PIPD] Bits */
#define ANACOMP1_PINCM_OUT_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define ANACOMP1_PINCM_OUT_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define ANACOMP1_PINCM_OUT_PIPD_NO_PULL_DOWN     ((uint32_t)0x00000000U)         /* !< No pull down */
#define ANACOMP1_PINCM_OUT_PIPD_PULL_DOWN        ((uint32_t)0x00010000U)         /* !< Pull down */
/* ANACOMP1_PINCM_OUT[PIPU] Bits */
#define ANACOMP1_PINCM_OUT_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define ANACOMP1_PINCM_OUT_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define ANACOMP1_PINCM_OUT_PIPU_NO_PULL_UP       ((uint32_t)0x00000000U)         /* !< No pull up */
#define ANACOMP1_PINCM_OUT_PIPU_PULL_UP          ((uint32_t)0x00020000U)         /* !< Pull up */
/* ANACOMP1_PINCM_OUT[INENA] Bits */
#define ANACOMP1_PINCM_OUT_INENA_OFS             (18)                            /* !< INENA Offset */
#define ANACOMP1_PINCM_OUT_INENA_MASK            ((uint32_t)0x00040000U)         /* !< Input enable */
#define ANACOMP1_PINCM_OUT_INENA_INP_DISABLE     ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define ANACOMP1_PINCM_OUT_INENA_INP_ENABLE      ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* ANACOMP1_PINCM_OUT[HYSTEN] Bits */
#define ANACOMP1_PINCM_OUT_HYSTEN_OFS            (19)                            /* !< HYSTEN Offset */
#define ANACOMP1_PINCM_OUT_HYSTEN_MASK           ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define ANACOMP1_PINCM_OUT_HYSTEN_DIS_HYST       ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define ANACOMP1_PINCM_OUT_HYSTEN_EN_HYST        ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* ANACOMP1_PINCM_OUT[DRV] Bits */
#define ANACOMP1_PINCM_OUT_DRV_OFS               (20)                            /* !< DRV Offset */
#define ANACOMP1_PINCM_OUT_DRV_MASK              ((uint32_t)0x00700000U)         /* !< Drive strength options */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_0        ((uint32_t)0x00000000U)         /* !< Lowest drive strength */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_1        ((uint32_t)0x00100000U)         /* !< Drive strength 2/8 */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_2        ((uint32_t)0x00200000U)         /* !< Drive strength 3/8 */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_3        ((uint32_t)0x00300000U)         /* !< Drive strength 4/8 */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_4        ((uint32_t)0x00400000U)         /* !< Drive strength 5/8 */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_5        ((uint32_t)0x00500000U)         /* !< Drive strength 6/8 */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_6        ((uint32_t)0x00600000U)         /* !< Drive strength 7/8 */
#define ANACOMP1_PINCM_OUT_DRV_STRENGTH_7        ((uint32_t)0x00700000U)         /* !< Highest drive strength */
/* ANACOMP1_PINCM_OUT[HIGHZ0] Bits */
#define ANACOMP1_PINCM_OUT_HIGHZ0_OFS            (24)                            /* !< HIGHZ0 Offset */
#define ANACOMP1_PINCM_OUT_HIGHZ0_MASK           ((uint32_t)0x01000000U)         /* !< High-Z instead of low output */
#define ANACOMP1_PINCM_OUT_HIGHZ0_DRV_LOW        ((uint32_t)0x00000000U)         /* !< Pin can be driven low */
#define ANACOMP1_PINCM_OUT_HIGHZ0_DRV_HIZ        ((uint32_t)0x01000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    low */
/* ANACOMP1_PINCM_OUT[HIGHZ1] Bits */
#define ANACOMP1_PINCM_OUT_HIGHZ1_OFS            (25)                            /* !< HIGHZ1 Offset */
#define ANACOMP1_PINCM_OUT_HIGHZ1_MASK           ((uint32_t)0x02000000U)         /* !< High-Z instead of high output */
#define ANACOMP1_PINCM_OUT_HIGHZ1_DRV_HIGH       ((uint32_t)0x00000000U)         /* !< Pin can be driven high */
#define ANACOMP1_PINCM_OUT_HIGHZ1_DRV_HIZ        ((uint32_t)0x02000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    high */
/* ANACOMP1_PINCM_OUT[INV] Bits */
#define ANACOMP1_PINCM_OUT_INV_OFS               (26)                            /* !< INV Offset */
#define ANACOMP1_PINCM_OUT_INV_MASK              ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define ANACOMP1_PINCM_OUT_INV_NO_CHNG           ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define ANACOMP1_PINCM_OUT_INV_CHNG              ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* ANACOMP1_PINCM_OUT[WUEN] Bits */
#define ANACOMP1_PINCM_OUT_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define ANACOMP1_PINCM_OUT_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define ANACOMP1_PINCM_OUT_WUEN_NO_WAKEUP        ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define ANACOMP1_PINCM_OUT_WUEN_WAKEUP           ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* ANACOMP1_PINCM_OUT[WCOMP] Bits */
#define ANACOMP1_PINCM_OUT_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define ANACOMP1_PINCM_OUT_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define ANACOMP1_PINCM_OUT_WCOMP_MATCH_ZERO      ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define ANACOMP1_PINCM_OUT_WCOMP_MATCH_ONE       ((uint32_t)0x10000000U)         /* !< Match 1 will wake */

/* ANACOMP1_FSUB_0 Bits */
/* ANACOMP1_FSUB_0[CHANID] Bits */
#define ANACOMP1_FSUB_0_CHANID_OFS               (0)                             /* !< CHANID Offset */
#define ANACOMP1_FSUB_0_CHANID_MASK              ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define ANACOMP1_FSUB_0_CHANID_MNIMUM            ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define ANACOMP1_FSUB_0_CHANID_UNCONNECTED       ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define ANACOMP1_FSUB_0_CHANID_MAXIMUM           ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* ANACOMP1_FSUB_1 Bits */
/* ANACOMP1_FSUB_1[CHANID] Bits */
#define ANACOMP1_FSUB_1_CHANID_OFS               (0)                             /* !< CHANID Offset */
#define ANACOMP1_FSUB_1_CHANID_MASK              ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define ANACOMP1_FSUB_1_CHANID_MNIMUM            ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define ANACOMP1_FSUB_1_CHANID_UNCONNECTED       ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define ANACOMP1_FSUB_1_CHANID_MAXIMUM           ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

