TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp1.h
/* ANACOMP1_FPUB_1 Bits */
/* ANACOMP1_FPUB_1[CHANID] Bits */
#define ANACOMP1_FPUB_1_CHANID_OFS               (0)                             /* !< CHANID Offset */
#define ANACOMP1_FPUB_1_CHANID_MASK              ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define ANACOMP1_FPUB_1_CHANID_MNIMUM            ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define ANACOMP1_FPUB_1_CHANID_UNCONNECTED       ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define ANACOMP1_FPUB_1_CHANID_MAXIMUM           ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* ANACOMP1_CPU_CONNECT_0 Bits */
/* ANACOMP1_CPU_CONNECT_0[CPUSS0_CONN] Bits */
#define ANACOMP1_CPU_CONNECT_0_CPUSS0_CONN_OFS   (1)                             /* !< CPUSS0_CONN Offset */
#define ANACOMP1_CPU_CONNECT_0_CPUSS0_CONN_MASK  ((uint32_t)0x00000002U)         /* !< CPUSS0 connect bit. */
#define ANACOMP1_CPU_CONNECT_0_CPUSS0_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define ANACOMP1_CPU_CONNECT_0_CPUSS0_CONN_CONNECTED ((uint32_t)0x00000002U)         /* !< The CPU is connected. */

/* ANACOMP1_EVT_MODE Bits */
/* ANACOMP1_EVT_MODE[INT0_CFG] Bits */
#define ANACOMP1_EVT_MODE_INT0_CFG_OFS           (0)                             /* !< INT0_CFG Offset */
#define ANACOMP1_EVT_MODE_INT0_CFG_MASK          ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT][0] */
#define ANACOMP1_EVT_MODE_INT0_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define ANACOMP1_EVT_MODE_INT0_CFG_SOFTWARE      ((uint32_t)0x00000001U)         /* !< Event handled by software. Software
                                                                                    must clear the associated RIS flag. */
#define ANACOMP1_EVT_MODE_INT0_CFG_HARDWARE      ((uint32_t)0x00000002U)         /* !< Event handled by hardware. The
                                                                                    hardware (another module) clears
                                                                                    automatically the associated RIS
                                                                                    flag. */
/* ANACOMP1_EVT_MODE[EVT1_CFG] Bits */
#define ANACOMP1_EVT_MODE_EVT1_CFG_OFS           (2)                             /* !< EVT1_CFG Offset */
#define ANACOMP1_EVT_MODE_EVT1_CFG_MASK          ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT][0] */
#define ANACOMP1_EVT_MODE_EVT1_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define ANACOMP1_EVT_MODE_EVT1_CFG_SOFTWARE      ((uint32_t)0x00000004U)         /* !< Event handled by software. Software
                                                                                    must clear the associated RIS flag. */
#define ANACOMP1_EVT_MODE_EVT1_CFG_HARDWARE      ((uint32_t)0x00000008U)         /* !< Event handled by hardware. The
                                                                                    hardware (another module) clears
                                                                                    automatically the associated RIS
                                                                                    flag. */

/* ANACOMP1_DESC Bits */
/* ANACOMP1_DESC[MINREV] Bits */
#define ANACOMP1_DESC_MINREV_OFS                 (0)                             /* !< MINREV Offset */
#define ANACOMP1_DESC_MINREV_MASK                ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
/* ANACOMP1_DESC[MAJREV] Bits */
#define ANACOMP1_DESC_MAJREV_OFS                 (4)                             /* !< MAJREV Offset */
#define ANACOMP1_DESC_MAJREV_MASK                ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
/* ANACOMP1_DESC[FEATUREVER] Bits */
#define ANACOMP1_DESC_FEATUREVER_OFS             (12)                            /* !< FEATUREVER Offset */
#define ANACOMP1_DESC_FEATUREVER_MASK            ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
/* ANACOMP1_DESC[MODULEID] Bits */
#define ANACOMP1_DESC_MODULEID_OFS               (16)                            /* !< MODULEID Offset */
#define ANACOMP1_DESC_MODULEID_MASK              ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */

/* ANACOMP1_CTL0 Bits */
/* ANACOMP1_CTL0[IPSEL] Bits */
#define ANACOMP1_CTL0_IPSEL_OFS                  (0)                             /* !< IPSEL Offset */
#define ANACOMP1_CTL0_IPSEL_MASK                 ((uint32_t)0x00000007U)         /* !< Channel input selected for the
                                                                                    positive terminal of the comparator
                                                                                    if IPEN is set to 1. */
#define ANACOMP1_CTL0_IPSEL_CH_0                 ((uint32_t)0x00000000U)         /* !< Channel 0 selected */
#define ANACOMP1_CTL0_IPSEL_CH_1                 ((uint32_t)0x00000001U)         /* !< Channel 1 selected */
#define ANACOMP1_CTL0_IPSEL_CH_2                 ((uint32_t)0x00000002U)         /* !< Channel 2 selected */
#define ANACOMP1_CTL0_IPSEL_CH_3                 ((uint32_t)0x00000003U)         /* !< Channel 3 selected */
#define ANACOMP1_CTL0_IPSEL_CH_4                 ((uint32_t)0x00000004U)         /* !< Channel 4 selected */
#define ANACOMP1_CTL0_IPSEL_CH_5                 ((uint32_t)0x00000005U)         /* !< Channel 5 selected */
#define ANACOMP1_CTL0_IPSEL_CH_6                 ((uint32_t)0x00000006U)         /* !< Channel 6 selected */
#define ANACOMP1_CTL0_IPSEL_CH_7                 ((uint32_t)0x00000007U)         /* !< Channel 7  selected */
/* ANACOMP1_CTL0[IPEN] Bits */
#define ANACOMP1_CTL0_IPEN_OFS                   (15)                            /* !< IPEN Offset */
#define ANACOMP1_CTL0_IPEN_MASK                  ((uint32_t)0x00008000U)         /* !< Channel input enable for the
                                                                                    positive terminal of the comparator. */
#define ANACOMP1_CTL0_IPEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Selected analog input channel for
                                                                                    positive terminal is disabled */
#define ANACOMP1_CTL0_IPEN_ENABLE                ((uint32_t)0x00008000U)         /* !< Selected analog input channel for
                                                                                    positive terminal is enabled */
/* ANACOMP1_CTL0[IMEN] Bits */
#define ANACOMP1_CTL0_IMEN_OFS                   (31)                            /* !< IMEN Offset */
#define ANACOMP1_CTL0_IMEN_MASK                  ((uint32_t)0x80000000U)         /* !< Channel input enable for the
                                                                                    negative terminal of the comparator. */
#define ANACOMP1_CTL0_IMEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Selected analog input channel for
                                                                                    negative terminal is disabled */
#define ANACOMP1_CTL0_IMEN_ENABLE                ((uint32_t)0x80000000U)         /* !< Selected analog input channel for
                                                                                    negative terminal is enabled */
/* ANACOMP1_CTL0[IMSEL] Bits */
#define ANACOMP1_CTL0_IMSEL_OFS                  (16)                            /* !< IMSEL Offset */
#define ANACOMP1_CTL0_IMSEL_MASK                 ((uint32_t)0x00070000U)         /* !< Channel input selected for the
                                                                                    negative terminal of the comparator
                                                                                    if IMEN is set to 1. */
#define ANACOMP1_CTL0_IMSEL_CH_0                 ((uint32_t)0x00000000U)         /* !< Channel 0 selected */
#define ANACOMP1_CTL0_IMSEL_CH_1                 ((uint32_t)0x00010000U)         /* !< Channel 1 selected */
#define ANACOMP1_CTL0_IMSEL_CH_2                 ((uint32_t)0x00020000U)         /* !< Channel 2 selected */
#define ANACOMP1_CTL0_IMSEL_CH_3                 ((uint32_t)0x00030000U)         /* !< Channel 3 selected */
#define ANACOMP1_CTL0_IMSEL_CH_4                 ((uint32_t)0x00040000U)         /* !< Channel 4 selected */
#define ANACOMP1_CTL0_IMSEL_CH_5                 ((uint32_t)0x00050000U)         /* !< Channel 5 selected */
#define ANACOMP1_CTL0_IMSEL_CH_6                 ((uint32_t)0x00060000U)         /* !< Channel 6 selected */
#define ANACOMP1_CTL0_IMSEL_CH_7                 ((uint32_t)0x00070000U)         /* !< Channel 7 selected */

