TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp1.h
/* ANACOMP1_CTL1 Bits */
/* ANACOMP1_CTL1[ENABLE] Bits */
#define ANACOMP1_CTL1_ENABLE_OFS                 (0)                             /* !< ENABLE Offset */
#define ANACOMP1_CTL1_ENABLE_MASK                ((uint32_t)0x00000001U)         /* !< This bit turns on the comparator.
                                                                                    When the comparator is turned off it
                                                                                    consumes no power. */
#define ANACOMP1_CTL1_ENABLE_OFF                 ((uint32_t)0x00000000U)         /* !< Comparator is off */
#define ANACOMP1_CTL1_ENABLE_ON                  ((uint32_t)0x00000001U)         /* !< Comparator is on */
/* ANACOMP1_CTL1[MODE] Bits */
#define ANACOMP1_CTL1_MODE_OFS                   (1)                             /* !< MODE Offset */
#define ANACOMP1_CTL1_MODE_MASK                  ((uint32_t)0x00000002U)         /* !< This bit selects the comparator
                                                                                    operating mode. */
#define ANACOMP1_CTL1_MODE_FAST                  ((uint32_t)0x00000000U)         /* !< Comparator is in fast mode */
#define ANACOMP1_CTL1_MODE_ULP                   ((uint32_t)0x00000002U)         /* !< Comparator is in ultra-low power
                                                                                    mode */
/* ANACOMP1_CTL1[EXCH] Bits */
#define ANACOMP1_CTL1_EXCH_OFS                   (2)                             /* !< EXCH Offset */
#define ANACOMP1_CTL1_EXCH_MASK                  ((uint32_t)0x00000004U)         /* !< This bit exchanges the comparator
                                                                                    inputs and inverts the comparator
                                                                                    output. */
#define ANACOMP1_CTL1_EXCH_NO_EXC                ((uint32_t)0x00000000U)         /* !< Comparator inputs not exchanged and
                                                                                    output not inverted */
#define ANACOMP1_CTL1_EXCH_EXC                   ((uint32_t)0x00000004U)         /* !< Comparator inputs exchanged and
                                                                                    output inverted */
/* ANACOMP1_CTL1[SHORT] Bits */
#define ANACOMP1_CTL1_SHORT_OFS                  (3)                             /* !< SHORT Offset */
#define ANACOMP1_CTL1_SHORT_MASK                 ((uint32_t)0x00000008U)         /* !< This bit shorts the positive and
                                                                                    negative input terminals of the
                                                                                    comparator. */
#define ANACOMP1_CTL1_SHORT_NO_SHT               ((uint32_t)0x00000000U)         /* !< Comparator positive and negative
                                                                                    input terminals are not shorted */
#define ANACOMP1_CTL1_SHORT_SHT                  ((uint32_t)0x00000008U)         /* !< Comparator positive and negative
                                                                                    input terminals are shorted */
/* ANACOMP1_CTL1[IES] Bits */
#define ANACOMP1_CTL1_IES_OFS                    (4)                             /* !< IES Offset */
#define ANACOMP1_CTL1_IES_MASK                   ((uint32_t)0x00000010U)         /* !< This bit selected the interrupt
                                                                                    edge for COMPIFG and COMPINVIFG. */
#define ANACOMP1_CTL1_IES_RISING                 ((uint32_t)0x00000000U)         /* !< Rising edge sets COMPIFG and
                                                                                    falling edge sets COMPINVIFG */
#define ANACOMP1_CTL1_IES_FALLING                ((uint32_t)0x00000010U)         /* !< Falling edge sets COMPIFG and
                                                                                    rising edge sets COMPINVIFG */
/* ANACOMP1_CTL1[HYST] Bits */
#define ANACOMP1_CTL1_HYST_OFS                   (5)                             /* !< HYST Offset */
#define ANACOMP1_CTL1_HYST_MASK                  ((uint32_t)0x00000060U)         /* !< These bits select the hysteresis
                                                                                    setting of the comparator. */
#define ANACOMP1_CTL1_HYST_NO_HYS                ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define ANACOMP1_CTL1_HYST_LOW_HYS               ((uint32_t)0x00000020U)         /* !< Low hysteresis, typical 10mV */
#define ANACOMP1_CTL1_HYST_MED_HYS               ((uint32_t)0x00000040U)         /* !< Medium hysteresis, typical 20mV */
#define ANACOMP1_CTL1_HYST_HIGH_HYS              ((uint32_t)0x00000060U)         /* !< High hysteresis, typical 30mV */
/* ANACOMP1_CTL1[OUTPOL] Bits */
#define ANACOMP1_CTL1_OUTPOL_OFS                 (7)                             /* !< OUTPOL Offset */
#define ANACOMP1_CTL1_OUTPOL_MASK                ((uint32_t)0x00000080U)         /* !< This bit selects the comparator
                                                                                    output polarity. */
#define ANACOMP1_CTL1_OUTPOL_NON_INV             ((uint32_t)0x00000000U)         /* !< Comparator output is non-inverted */
#define ANACOMP1_CTL1_OUTPOL_INV                 ((uint32_t)0x00000080U)         /* !< Comparator output is inverted */
/* ANACOMP1_CTL1[FLTEN] Bits */
#define ANACOMP1_CTL1_FLTEN_OFS                  (8)                             /* !< FLTEN Offset */
#define ANACOMP1_CTL1_FLTEN_MASK                 ((uint32_t)0x00000100U)         /* !< This bit enables the analog filter
                                                                                    at comparator output. */
#define ANACOMP1_CTL1_FLTEN_DISABLE              ((uint32_t)0x00000000U)         /* !< Comparator output filter is
                                                                                    disabled */
#define ANACOMP1_CTL1_FLTEN_ENABLE               ((uint32_t)0x00000100U)         /* !< Comparator output filter is enabled */
/* ANACOMP1_CTL1[FLTDLY] Bits */
#define ANACOMP1_CTL1_FLTDLY_OFS                 (9)                             /* !< FLTDLY Offset */
#define ANACOMP1_CTL1_FLTDLY_MASK                ((uint32_t)0x00000600U)         /* !< These bits select the comparator
                                                                                    output filter delay. See the
                                                                                    device-specific data sheet for
                                                                                    specific values on comparator
                                                                                    propagation delay for different
                                                                                    filter delay settings. */
#define ANACOMP1_CTL1_FLTDLY_DLY_0               ((uint32_t)0x00000000U)         /* !< Typical filter delay of 70 ns */
#define ANACOMP1_CTL1_FLTDLY_DLY_1               ((uint32_t)0x00000200U)         /* !< Typical filter delay of 500 ns */
#define ANACOMP1_CTL1_FLTDLY_DLY_2               ((uint32_t)0x00000400U)         /* !< Typical filter delay of 1200 ns */
#define ANACOMP1_CTL1_FLTDLY_DLY_3               ((uint32_t)0x00000600U)         /* !< Typical filter delay of 2700 ns */
/* ANACOMP1_CTL1[DACOUTEN] Bits */
#define ANACOMP1_CTL1_DACOUTEN_OFS               (11)                            /* !< DACOUTEN Offset */
#define ANACOMP1_CTL1_DACOUTEN_MASK              ((uint32_t)0x00000800U)         /* !< This bit enables DAC8 output to be
                                                                                    connected to the pin. */
#define ANACOMP1_CTL1_DACOUTEN_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable the DAC8 output
                                                                                    connectivity to pin. */
#define ANACOMP1_CTL1_DACOUTEN_ENABLE            ((uint32_t)0x00000800U)         /* !< Enable the DAC8 output connectivity
                                                                                    to pin. */
/* ANACOMP1_CTL1[WINCOMPEN] Bits */
#define ANACOMP1_CTL1_WINCOMPEN_OFS              (12)                            /* !< WINCOMPEN Offset */
#define ANACOMP1_CTL1_WINCOMPEN_MASK             ((uint32_t)0x00001000U)         /* !< This bit enables window comparator
                                                                                    operation of comparator. */
#define ANACOMP1_CTL1_WINCOMPEN_OFF              ((uint32_t)0x00000000U)         /* !< window comparator is disable */
#define ANACOMP1_CTL1_WINCOMPEN_ON               ((uint32_t)0x00001000U)         /* !< window comparator is enable */

/* ANACOMP1_CTL2 Bits */
/* ANACOMP1_CTL2[REFMODE] Bits */
#define ANACOMP1_CTL2_REFMODE_OFS                (0)                             /* !< REFMODE Offset */
#define ANACOMP1_CTL2_REFMODE_MASK               ((uint32_t)0x00000001U)         /* !< This bit requests ULP_REF bandgap
                                                                                    operation in fast mode(static) or low
                                                                                    power mode (sampled). The local
                                                                                    reference buffer and 8-bit DAC inside
                                                                                    comparator module are also configured
                                                                                    accordingly.  Fast mode operation
                                                                                    offers higher accuracy but consumes
                                                                                    higher current. Low power operation
                                                                                    consumes lower current but with
                                                                                    relaxed reference voltage accuracy.
                                                                                    Comparator requests for reference
                                                                                    voltage from ULP_REF only when REFLVL
                                                                                    > 0. */
#define ANACOMP1_CTL2_REFMODE_STATIC             ((uint32_t)0x00000000U)         /* !< ULP_REF bandgap, local reference
                                                                                    buffer and 8-bit DAC inside
                                                                                    comparator operate in static mode. */
#define ANACOMP1_CTL2_REFMODE_SAMPLED            ((uint32_t)0x00000001U)         /* !< ULP_REF bandgap, local reference
                                                                                    buffer and 8-bit DAC inside
                                                                                    comparator operate in sampled mode. */
/* ANACOMP1_CTL2[REFSRC] Bits */
#define ANACOMP1_CTL2_REFSRC_OFS                 (3)                             /* !< REFSRC Offset */
#define ANACOMP1_CTL2_REFSRC_MASK                ((uint32_t)0x00000038U)         /* !< These bits select the reference
                                                                                    source for the comparator. */
#define ANACOMP1_CTL2_REFSRC_OFF                 ((uint32_t)0x00000000U)         /* !< Reference voltage generator is
                                                                                    disabled (local reference buffer as
                                                                                    well as DAC). */
#define ANACOMP1_CTL2_REFSRC_VDDA_DAC            ((uint32_t)0x00000008U)         /* !< VDDA selected as the reference
                                                                                    source to DAC and DAC output applied
                                                                                    as reference to comparator. */
#define ANACOMP1_CTL2_REFSRC_VREF_DAC            ((uint32_t)0x00000010U)         /* !< VREF selected as reference to DAC
                                                                                    and DAC output applied as reference
                                                                                    to comparator. */
#define ANACOMP1_CTL2_REFSRC_VREF                ((uint32_t)0x00000018U)         /* !< VREF applied as reference to
                                                                                    comparator. DAC is switched off. */
/* ANACOMP1_CTL2[REFSEL] Bits */
#define ANACOMP1_CTL2_REFSEL_OFS                 (7)                             /* !< REFSEL Offset */
#define ANACOMP1_CTL2_REFSEL_MASK                ((uint32_t)0x00000080U)         /* !< This bit selects if the selected
                                                                                    reference voltage is applied to
                                                                                    positive or negative terminal of the
                                                                                    comparator. */
#define ANACOMP1_CTL2_REFSEL_POSITIVE            ((uint32_t)0x00000000U)         /* !< If EXCH bit is 0, the selected
                                                                                    reference is applied to positive
                                                                                    terminal. If EXCH bit is 1, the
                                                                                    selected reference is applied to
                                                                                    negative terminal. */
#define ANACOMP1_CTL2_REFSEL_NEGATIVE            ((uint32_t)0x00000080U)         /* !< If EXCH bit is 0, the selected
                                                                                    reference is applied to negative
                                                                                    terminal. If EXCH bit is 1, the
                                                                                    selected reference is applied to
                                                                                    positive terminal. */
/* ANACOMP1_CTL2[DACCTL] Bits */
#define ANACOMP1_CTL2_DACCTL_OFS                 (16)                            /* !< DACCTL Offset */
#define ANACOMP1_CTL2_DACCTL_MASK                ((uint32_t)0x00010000U)         /* !< This bit determines if the
                                                                                    comparator output or DACSW bit
                                                                                    controls the selection between
                                                                                    DACCODE0 and DACCODE1. */
#define ANACOMP1_CTL2_DACCTL_COMPOUT_SEL         ((uint32_t)0x00000000U)         /* !< Comparator output controls
                                                                                    selection between DACCODE0 and
                                                                                    DACCODE1 */
#define ANACOMP1_CTL2_DACCTL_DACSW_SEL           ((uint32_t)0x00010000U)         /* !< DACSW bit controls selection
                                                                                    between DACCODE0 and DACCODE1 */
/* ANACOMP1_CTL2[DACSW] Bits */
#define ANACOMP1_CTL2_DACSW_OFS                  (17)                            /* !< DACSW Offset */
#define ANACOMP1_CTL2_DACSW_MASK                 ((uint32_t)0x00020000U)         /* !< This bit selects between DACCODE0
                                                                                    and DACCODE1 to 8-bit DAC when DACCTL
                                                                                    bit is 1. */
#define ANACOMP1_CTL2_DACSW_DACCODE0_SEL         ((uint32_t)0x00000000U)         /* !< DACCODE0 selected for 8-bit DAC */
#define ANACOMP1_CTL2_DACSW_DACCODE1_SEL         ((uint32_t)0x00020000U)         /* !< DACCODE1 selected for 8-bit DAC */
/* ANACOMP1_CTL2[BLANKSRC] Bits */
#define ANACOMP1_CTL2_BLANKSRC_OFS               (8)                             /* !< BLANKSRC Offset */
#define ANACOMP1_CTL2_BLANKSRC_MASK              ((uint32_t)0x00000700U)         /* !< These bits select the blanking
                                                                                    source for the comparator. */
#define ANACOMP1_CTL2_BLANKSRC_DISABLE           ((uint32_t)0x00000000U)         /* !< Blanking source disabled */
#define ANACOMP1_CTL2_BLANKSRC_BLANKSRC1         ((uint32_t)0x00000100U)         /* !< Select Blanking Source 1 */
#define ANACOMP1_CTL2_BLANKSRC_BLANKSRC2         ((uint32_t)0x00000200U)         /* !< Select Blanking Source 2 */
#define ANACOMP1_CTL2_BLANKSRC_BLANKSRC3         ((uint32_t)0x00000300U)         /* !< Select Blanking Source 3 */
#define ANACOMP1_CTL2_BLANKSRC_BLANKSRC4         ((uint32_t)0x00000400U)         /* !< Select Blanking Source 4 */
#define ANACOMP1_CTL2_BLANKSRC_BLANKSRC5         ((uint32_t)0x00000500U)         /* !< Select Blanking Source 5 */
#define ANACOMP1_CTL2_BLANKSRC_BLANKSRC6         ((uint32_t)0x00000600U)         /* !< Select Blanking Source 6 */
/* ANACOMP1_CTL2[SAMPMODE] Bits */
#define ANACOMP1_CTL2_SAMPMODE_OFS               (24)                            /* !< SAMPMODE Offset */
#define ANACOMP1_CTL2_SAMPMODE_MASK              ((uint32_t)0x01000000U)         /* !< Enable sampled mode of comparator. */
#define ANACOMP1_CTL2_SAMPMODE_DISABLE           ((uint32_t)0x00000000U)         /* !< Sampled mode disabled */
#define ANACOMP1_CTL2_SAMPMODE_ENABLE            ((uint32_t)0x01000000U)         /* !< Sampled mode enabled */

/* ANACOMP1_CTL3 Bits */
/* ANACOMP1_CTL3[DACCODE0] Bits */
#define ANACOMP1_CTL3_DACCODE0_OFS               (0)                             /* !< DACCODE0 Offset */
#define ANACOMP1_CTL3_DACCODE0_MASK              ((uint32_t)0x000000FFU)         /* !< This is the first 8-bit DAC code.
                                                                                    When the DAC code is 0x0 the DAC
                                                                                    output will be 0 V. When the DAC code
                                                                                    is 0xFF the DAC output will be
                                                                                    selected reference voltage x 255/256. */
#define ANACOMP1_CTL3_DACCODE0_MNIMUM            ((uint32_t)0x00000000U)         /* !< Minimum DAC code value */
#define ANACOMP1_CTL3_DACCODE0_MAXIMUM           ((uint32_t)0x000000FFU)         /* !< Minimum DAC code value */
/* ANACOMP1_CTL3[DACCODE1] Bits */
#define ANACOMP1_CTL3_DACCODE1_OFS               (16)                            /* !< DACCODE1 Offset */
#define ANACOMP1_CTL3_DACCODE1_MASK              ((uint32_t)0x00FF0000U)         /* !< This is the second 8-bit DAC code.
                                                                                    When the DAC code is 0x0 the DAC
                                                                                    output will be 0 V. When the DAC code
                                                                                    is 0xFF the DAC output will be
                                                                                    selected reference voltage x 255/256. */
#define ANACOMP1_CTL3_DACCODE1_MNIMUM            ((uint32_t)0x00000000U)         /* !< Minimum DAC code value */
#define ANACOMP1_CTL3_DACCODE1_MAXIMUM           ((uint32_t)0x00FF0000U)         /* !< Minimum DAC code value */

/* ANACOMP1_STAT Bits */
/* ANACOMP1_STAT[OUT] Bits */
#define ANACOMP1_STAT_OUT_OFS                    (0)                             /* !< OUT Offset */
#define ANACOMP1_STAT_OUT_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reflects the value of the
                                                                                    comparator output. Writing to this
                                                                                    bit has no effect on the comparator
                                                                                    output. */
#define ANACOMP1_STAT_OUT_LOW                    ((uint32_t)0x00000000U)         /* !< Comparator output is low */
#define ANACOMP1_STAT_OUT_HIGH                   ((uint32_t)0x00000001U)         /* !< Comparator output is high */

/* ANACOMP1_ANACMPWKUPCTL Bits */
/* ANACOMP1_ANACMPWKUPCTL[ANALOGCOMPARISONWAKEUPENABLEBIT] Bits */
#define ANACOMP1_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_OFS (0)                             /* !< ANALOGCOMPARISONWAKEUPENABLEBIT
                                                                                    Offset */
#define ANACOMP1_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_MASK ((uint32_t)0x00000001U)         /* !< 0: Analog comparison wakeup is
                                                                                    disabled (back ward compatible with
                                                                                    existing IP) 1 : Analog comparison
                                                                                    feature is enabled */

