TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp1.h
/* ANACOMP1_ANACMPCTRCTL Bits */
/* ANACOMP1_ANACMPCTRCTL[BLKCMPPRD] Bits */
#define ANACOMP1_ANACMPCTRCTL_BLKCMPPRD_OFS      (0)                             /* !< BLKCMPPRD Offset */
#define ANACOMP1_ANACMPCTRCTL_BLKCMPPRD_MASK     ((uint32_t)0x000000FFU)         /* !< Blanking and comparision period */
/* ANACOMP1_ANACMPCTRCTL[CMPPRD] Bits */
#define ANACOMP1_ANACMPCTRCTL_CMPPRD_OFS         (8)                             /* !< CMPPRD Offset */
#define ANACOMP1_ANACMPCTRCTL_CMPPRD_MASK        ((uint32_t)0x00000F00U)         /* !< Comparision period */

/* ANACOMP1_ANACMPDACCODE Bits */
/* ANACOMP1_ANACMPDACCODE[IP0DACCODE] Bits */
#define ANACOMP1_ANACMPDACCODE_IP0DACCODE_OFS    (0)                             /* !< IP0DACCODE Offset */
#define ANACOMP1_ANACMPDACCODE_IP0DACCODE_MASK   ((uint32_t)0x000000FFU)         /* !< Input0 daccode value */
/* ANACOMP1_ANACMPDACCODE[IP1DACCODE] Bits */
#define ANACOMP1_ANACMPDACCODE_IP1DACCODE_OFS    (8)                             /* !< IP1DACCODE Offset */
#define ANACOMP1_ANACMPDACCODE_IP1DACCODE_MASK   ((uint32_t)0x0000FF00U)         /* !< Input1 daccode value */
/* ANACOMP1_ANACMPDACCODE[IP2DACCODE] Bits */
#define ANACOMP1_ANACMPDACCODE_IP2DACCODE_OFS    (16)                            /* !< IP2DACCODE Offset */
#define ANACOMP1_ANACMPDACCODE_IP2DACCODE_MASK   ((uint32_t)0x00FF0000U)         /* !< Input2 daccode value */
/* ANACOMP1_ANACMPDACCODE[IP3DACCODE] Bits */
#define ANACOMP1_ANACMPDACCODE_IP3DACCODE_OFS    (24)                            /* !< IP3DACCODE Offset */
#define ANACOMP1_ANACMPDACCODE_IP3DACCODE_MASK   ((uint32_t)0xFF000000U)         /* !< Input3 daccode value */

/* ANACOMP1_ANACMPWD Bits */
/* ANACOMP1_ANACMPWD[WDEN] Bits */
#define ANACOMP1_ANACMPWD_WDEN_OFS               (0)                             /* !< WDEN Offset */
#define ANACOMP1_ANACMPWD_WDEN_MASK              ((uint32_t)0x00000001U)         /* !< 0 :  Window mode disable 1 :
                                                                                    Window mode enable */
/* ANACOMP1_ANACMPWD[INMUXSEL_WD] Bits */
#define ANACOMP1_ANACMPWD_INMUXSEL_WD_OFS        (1)                             /* !< INMUXSEL_WD Offset */
#define ANACOMP1_ANACMPWD_INMUXSEL_WD_MASK       ((uint32_t)0x00000006U)         /* !< Input mux (Static) selection for
                                                                                    window mode */

/* ANACOMP1_ANACMPCHSTS Bits */
/* ANACOMP1_ANACMPCHSTS[IN0EVT] Bits */
#define ANACOMP1_ANACMPCHSTS_IN0EVT_OFS          (0)                             /* !< IN0EVT Offset */
#define ANACOMP1_ANACMPCHSTS_IN0EVT_MASK         ((uint32_t)0x00000001U)         /* !< Input0 caused event */
/* ANACOMP1_ANACMPCHSTS[IN1EVT] Bits */
#define ANACOMP1_ANACMPCHSTS_IN1EVT_OFS          (1)                             /* !< IN1EVT Offset */
#define ANACOMP1_ANACMPCHSTS_IN1EVT_MASK         ((uint32_t)0x00000002U)         /* !< Input1 caused event */
/* ANACOMP1_ANACMPCHSTS[IN2EVT] Bits */
#define ANACOMP1_ANACMPCHSTS_IN2EVT_OFS          (2)                             /* !< IN2EVT Offset */
#define ANACOMP1_ANACMPCHSTS_IN2EVT_MASK         ((uint32_t)0x00000004U)         /* !< Input2 caused event */
/* ANACOMP1_ANACMPCHSTS[IN3EVT] Bits */
#define ANACOMP1_ANACMPCHSTS_IN3EVT_OFS          (3)                             /* !< IN3EVT Offset */
#define ANACOMP1_ANACMPCHSTS_IN3EVT_MASK         ((uint32_t)0x00000008U)         /* !< Input3 caused event */

/* ANACOMP1_ANACMPCHSTSCLR Bits */
/* ANACOMP1_ANACMPCHSTSCLR[IN0EVTCLR] Bits */
#define ANACOMP1_ANACMPCHSTSCLR_IN0EVTCLR_OFS    (0)                             /* !< IN0EVTCLR Offset */
#define ANACOMP1_ANACMPCHSTSCLR_IN0EVTCLR_MASK   ((uint32_t)0x00000001U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* ANACOMP1_ANACMPCHSTSCLR[IN1EVTCLR] Bits */
#define ANACOMP1_ANACMPCHSTSCLR_IN1EVTCLR_OFS    (1)                             /* !< IN1EVTCLR Offset */
#define ANACOMP1_ANACMPCHSTSCLR_IN1EVTCLR_MASK   ((uint32_t)0x00000002U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* ANACOMP1_ANACMPCHSTSCLR[IN2EVTCLR] Bits */
#define ANACOMP1_ANACMPCHSTSCLR_IN2EVTCLR_OFS    (2)                             /* !< IN2EVTCLR Offset */
#define ANACOMP1_ANACMPCHSTSCLR_IN2EVTCLR_MASK   ((uint32_t)0x00000004U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* ANACOMP1_ANACMPCHSTSCLR[IN3EVTCLR] Bits */
#define ANACOMP1_ANACMPCHSTSCLR_IN3EVTCLR_OFS    (3)                             /* !< IN3EVTCLR Offset */
#define ANACOMP1_ANACMPCHSTSCLR_IN3EVTCLR_MASK   ((uint32_t)0x00000008U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_anacomp1__include */

